[
    {
        "name": "Starting Line",
        "description1": "The racers are off! Leading the pack with an amazing head start is ",
        "description1_type": "",
        "description1_car": "",
        "description2": "! Not far behind are the other racers. Out in the pack ",
        "description2_type": "advance",
        "description2_car": "",
        "description3": " makes a sweet mauever and ends up pushing ahead. Meanwhile ",
        "description3_type": "fall_behind",
        "description3_car": "",
        "description4": " gets overwhelmed by the chaos and pulls back. Looks like the inital order is: ",
        "locations": ["startingline"],
        "first_place": true,
        "crash": false,
        "advance": true,
        "fall_behind": true
    },
    {
        "name": "finish_line",
        "description1": "The racers are neck and neck it! It seems to be a close call between ",
        "description1_type": "firstplace",
        "description2": "and ",
        "description2_type": "secondplace",
        "description3": ". Here they come, near the finish line... and by a hair the winner is ",
        "description3_type": "winner",
        "description4": "!",
        "firstplace": true,
        "firstplace_car": "",
        "secondplace": true,
        "secondplace_car": "",
        "winner": true,
        "winner_car": "",
        "locations": ["finishline"]
    },
    {
        "name": "squeeze",
        "description1": "As the cars close up the pass, wait it seems that two racers are both trying to take up the space in the pass! They're grinding up against each other suddenly it seems ",
        "description1_type": "advance",
        "description1_car": "",
        "description2": " rams into ",
        "description2_type": "crash",
        "description2_car": "",
        "description3": " who is right next to them, causing them to carene of the side of the plateu so they can take the lead! ",
        "description3_type": "",
        "description3_car": "",
        "description4": " looks on in terror!",
        "locations": ["plateau"],
        "crash": true,
        "advance": true,
        "fall_behind": false
    },
    {
        "name": "running_of_the_coeds",
        "description1": "Suddenly a flock of beautiful and skantikly clad Coeds come running out of the beach! It was homecoming social! Look out racers. \n It seems ",
        "description1_type": "fall_behind",
        "description1_car": "",
        "description2": " is becoming a bit distracted but those kids and their slowmo Baywatch run, and is starting to lag backwards. Meanwhile ",
        "description2_type": "advance",
        "description2_car": "",
        "description3": " is undetered and is staying the course, taking their chaste discipline and channeling into finding an opening and advancing!. They seem to be doing well _ oh it looks like ",
        "description3_type": "crash",
        "description3_car": "",
        "description4": " has mistakenly drifted into the sandbank and has gotten stuck after gazing too long on those youthful, perfectly bronzed bodies!",
        "locations": ["beach"],
        "crash": true,
        "advance": true,
        "fall_behind": true
    },
    {
        "name": "park_king_canon",
        "description1": "As they round the turns the racers are all perfectly drifting along the cruve. Wait, it seems that the Park-King structure is pulling out their secret weapon. They are taking cars from off the structure and loading them into the side canon and firing them at the other racers. He takes aim at",
        "description1_type": "",
        "description1_car": "",
        "description2": " but it seems he misses, he's firing now openly on the other racers, but they are all bobbing and weaving, perfetly avoiding the bombardment of paying customer's vehicles being launched towrads them in a vicious barrage. Amidst the chaos, ",
        "description2_type": "advance",
        "description2_car": "",
        "description3": " takes a lead and ",
        "description3_type": "fall_behind",
        "description4": " while trying to avoid all those carses.",
        "locations": ["spiral"],
        "crash": false,
        "advance": true,
        "fall_behind": true
    },
    {
        "name": "Toto Appears",
        "description1": "A wild Toto appears! They starting singing their one hit wonder, \"Africa\" and ",
        "description1_type": "",
        "description1_car": "",
        "description2": "starts jamming out! Oh no, it seems their soothing vibes have actually summoned the conintental rains of Africa, as a freak monsoon happens out of nowhere, the cars are struggling to stay on course as they risk the track becoming slick with temperate climate based precipitation! It seems ",
        "description2_type": "crash",
        "description3": " has just hydroplaned right off the edge of the course, oh no! With some quick thinking, it seems",
        "description3_type": "",
        "description4": "starts playing \"Land Down Under\" by Men at Work, the scientific inverse of \"Africa\"! Toto shriek in horror and vanish into the sensitive mists from which they came.",
        "locations": ["plateau", "spiral"],
        "crash": true,
        "advance": false,
        "fall_behind": false
    },
    {
        "name": "turbo_boost",
        "description1": "The as they enter the track, the cars are doing alright when suddenly ",
        "description1_type": "advance",
        "description1_car": "",
        "description2": "activates their super Turbo Nitrus Special boost and speeds forward in the stretch! Oh and it looks like",
        "description2_car": "",
        "description2_type": "fall_behind",
        "description3": " is trying to make a similar move, but they seem to have flubbed the activation to their Booster Booster Tenitus Nectarine drive, and seems to have slipped a bit.seems stunned. Nearby ",
        "description3_type": "",
        "description3_car": "",
        "description4": "seems stunned!",
        "locations": ["spiral", "beach"],
        "crash": false,
        "advance": true,
        "fall_behind": true
    },
    {
        "name": "Invaders from Outer Space",
        "description1": "Why it seems invaders from outerspace have picked now of all times to land on earth. As they do they are bombarding the track with most likely hostile lasers, maybe lasers mean peace for these creatures? Right away a laser hits ",
        "description1_type": "crash",
        "description1_car": "",
        "description2": " as they spin out in a firey blaze. The other racers hold on tight. Why the driver of ",
        "description2_type": "",
        "description2_car": "", 
        "description3": " is actually making googly eyes at the aliens. What is this, a xenospecies flirty advance. Now it seems ",
        "description3_type": "",
        "description3_car": "",
        "description4": " has joined in. Oh between the two, they seem to prefer the latter. They give a sweet flying sauce back bumper push real fast giving them a lead! Then those aliens show they can take a hint and get out of here. Maybe we'll hear from them another year.",
        "locations": ["beach", "plateau", "spiral"],
        "crash": true,
        "advance": true,
        "fall_behind": false
    }
]

